---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TrussElementCreateTopParam
source: html/4286848a-e737-87b3-b1ab-43ae486848f4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TrussElementCreateTopParam Property

"Create Top Chord"

## Syntax (C#)
```csharp
public static ForgeTypeId TrussElementCreateTopParam { get; }
```